Repository: lcmaquino/subscriber-login-for-youtube
Catalog: languages/subscriber-login-for-youtube-*.po
Languages: pt_br

source: Subscriber Login for YouTube enables user sign in with their YouTube account.
pt_br: Subscriber Login for YouTube permite que o usuário faça login com sua conta do YouTube.

source: Settings
pt_br: Configurações

source: Google Client ID
pt_br: ID do Cliente Google

source: Google Client secret
pt_br: Chave do Cliente Google

source: Google Client redirect URI
pt_br: Redirecionamento do Cliente Google

source: Google Client
pt_br: Cliente Google

source: YouTube Channel ID
pt_br: ID do Canal no YouTube

source: YouTube Channel Title
pt_br: Título do Canal no YouTube

source: YouTube Channel URI
pt_br: URI do Canal no YouTube

source: User profile
pt_br: Imagem do perfil

source: Default role
pt_br: Papel padrão

source: User registration
pt_br: Registro do Usuário

source: Always show the Google account consent screen
pt_br: Sempre exibir a tela de consentimento da conta do Google

source: Login page
pt_br: Página de Login

source: YouTube Channel ID is required
pt_br: É necessário um ID do Canal no YouTube

source: YouTube Channel Title is required
pt_br: É necessário um Título do Canal no YouTube

source: YouTube Channel URI should be like %s
pt_br: URI do Canal no YouTube deve ser algo como %s

source: Google Client ID is required
pt_br: É necessário um ID do Cliente Google

source: Google Client secret is required
pt_br: É necessário uma chave do Cliente Google

source: Google Client redirect URI should be something like <code>%s</code>.
pt_br: É necessário um URI válido como, por exemplo, <code>%s</code> para o URI de redirecionamento do Cliente Google.

source: Basic
pt_br: Básico

source: Full
pt_br: Completo

source: You can see your YouTube Channel ID in your <a href="%s">advanced account settings</a> on YouTube.
pt_br: Você pode ver o seu ID do Canal no YouTube nas suas <a href="%s">Configurações avançadas</a> no site do YouTube.

source: Before using this plugin, you need to set up a Google project for web application in <a href="%1$s">Google Console</a>. It's a Google requirement for users to login! The web application project will provide: "%2$s", "%3$s", and "%4$s".
pt_br: Antes de usar este plugin, você precisa configurar um projeto de aplicação web no <a href="%1$s">Google Console</a>. Isso é um requisito do Google para fazer o login dos usuários! A aplicação web fornecerá: "%2$s", "%3$s" e "%4$s".

source: Activate the "YouTube Data API v3" in your project and add the scopes <code>%1$s</code>, <code>%2$s</code>, and <code>%3$s</code> for its consent screen. See more details in <a href="%4$s">%5$s</a>.
pt_br: Ative a opção "YouTube Data API v3" no seu projeto e adicione os escopos <code>%1$s</code>, <code>%2$s</code> e <code>%3$s</code> na sua tela de consentimento. Vide mais detalhes em <a href="%4$s">%5$s</a>.

source: Set your project "%1$s" to be something like <code>%2$s</code>.
pt_br: Configure o "%1$s" do seu projeto para ser algo do tipo <code>%2$s</code>.

source: The "%s" user profile stores: email and picture.
pt_br: O perfil "%s" armazena: e-mail e imagem do perfil.

source: The "%s" user profile stores: email, picture, full name, given name, family name, and locale. This option only works if the scope <code>%2$s</code> is added to the Google web application project.
pt_br: O perfil "%s" armazena: e-mail, imagem do perfil, nome completo, primeiro nome, sobrenome e localização. Essa opção só funciona se o escopo <code>%2$s</code> for adicionado ao projeto de aplicação web no Google Console.

source: When users login for the first time they will be registrated as the "%s".
pt_br: Quando os usuários fizerem login pela primeira vez eles serão registrados como "%s".

source: Add the filter <code>%s</code> to custom your sign in button.
pt_br: Adicione o filtro <code>%s</code> para personalizar o seu botão de "Entrar com o YouTube".

source: Example
pt_br: Exemplo

source: Add to <code>%s</code> template file the following code.
pt_br: Adicione o código a seguir no arquivo <code>%s</code> do tema.

source: %s &bullet; Settings
pt_br: %s &bullet; Configurações

source: Save
pt_br: Salvar

source: Sign in with YouTube
pt_br: Entrar com o YouTube

source: YouTube icon
pt_br: Ícone do YouTube

source: You need to subscribe to <a href="%1$s">%2$s</a> for login.
pt_br: Você precisa inscrever-se no canal <a href="%1$s">%2$s</a> para entrar no site.

source: Google account
pt_br: Conta do Google

source: Revoke access
pt_br: Revogar acesso

source: Revoke the website access to this Google account.
pt_br: Revogar o acesso desse website à conta Google do usuário.

source: This Google account was revoked.
pt_br: O acesso a esta conta do Google foi revogado.

source: %1$s requires PHP version %2$s or later. This plugin is NOT RUNING.
pt_br: %1$s requer o PHP versão %2$s ou posterior. Esse plugin NÃO ESTÁ EXECUTANDO.

source: %1$s requires WordPress version %2$s or later. This plugin is NOT RUNING.
pt_br: %1$s requer o WordPress versão %2$s ou posterior. Esse plugin NÃO ESTÁ EXECUTANDO.
